In [2]:
import numpy as np
import pandas as pd

In [4]:
s1 = pd.Series(np.linspace(1, 100, 10))
s1

0      1.0
1     12.0
2     23.0
3     34.0
4     45.0
5     56.0
6     67.0
7     78.0
8     89.0
9    100.0
dtype: float64

In [6]:
s1 = pd.Series(np.linspace(1, 100, 10), index=list('abcdefghij'))
s1

a      1.0
b     12.0
c     23.0
d     34.0
e     45.0
f     56.0
g     67.0
h     78.0
i     89.0
j    100.0
dtype: float64

In [8]:
d = dict(zip('fghijklmno', range(10)))
d

{'f': 0,
 'g': 1,
 'h': 2,
 'i': 3,
 'j': 4,
 'k': 5,
 'l': 6,
 'm': 7,
 'n': 8,
 'o': 9}

In [10]:
s2 = pd.Series(d)
s2

f    0
g    1
h    2
i    3
j    4
k    5
l    6
m    7
n    8
o    9
dtype: int64

In [14]:
s3 = pd.Series(5, index=list('xyz'))
s3

x    5
y    5
z    5
dtype: int64

In [15]:
s1[0]

1.0

In [17]:
s1[:3]

a     1.0
b    12.0
c    23.0
dtype: float64

In [26]:
s1[s1 > s1.median()]

f     56.0
g     67.0
h     78.0
i     89.0
j    100.0
dtype: float64

In [28]:
s1[9::-2]

j    100.0
h     78.0
f     56.0
d     34.0
b     12.0
dtype: float64

In [29]:
np.exp(s1)

a    2.718282e+00
b    1.627548e+05
c    9.744803e+09
d    5.834617e+14
e    3.493427e+19
f    2.091659e+24
g    1.252363e+29
h    7.498417e+33
i    4.489613e+38
j    2.688117e+43
dtype: float64

In [30]:
s1.dtype

dtype('float64')

In [38]:
pd.Series(['hello', 'hello'])

0    hello
1    hello
dtype: object

In [39]:
s1.shape

(10,)

In [40]:
s1['a']

1.0

In [41]:
s1['j'] = 200.

In [42]:
s1.get('c')

23.0

In [44]:
s1 + s1

a      2.0
b     24.0
c     46.0
d     68.0
e     90.0
f    112.0
g    134.0
h    156.0
i    178.0
j    400.0
dtype: float64

In [46]:
s1 + s2

a      NaN
b      NaN
c      NaN
d      NaN
e      NaN
f     56.0
g     68.0
h     80.0
i     92.0
j    204.0
k      NaN
l      NaN
m      NaN
n      NaN
o      NaN
dtype: float64

In [47]:
s1[::-1]

j    200.0
i     89.0
h     78.0
g     67.0
f     56.0
e     45.0
d     34.0
c     23.0
b     12.0
a      1.0
dtype: float64

In [50]:
s1[::-1] + s1

a      2.0
b     24.0
c     46.0
d     68.0
e     90.0
f    112.0
g    134.0
h    156.0
i    178.0
j    400.0
dtype: float64

In [51]:
s2 - s1

a      NaN
b      NaN
c      NaN
d      NaN
e      NaN
f    -56.0
g    -66.0
h    -76.0
i    -86.0
j   -196.0
k      NaN
l      NaN
m      NaN
n      NaN
o      NaN
dtype: float64

In [53]:
s1.to_numpy() + s2.to_numpy()

array([  1.,  13.,  25.,  37.,  49.,  61.,  73.,  85.,  97., 209.])

In [55]:
s1.index = s2.index

In [56]:
s1.index

Index(['f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o'], dtype='object')

In [57]:
s1

f      1.0
g     12.0
h     23.0
i     34.0
j     45.0
k     56.0
l     67.0
m     78.0
n     89.0
o    200.0
dtype: float64

In [58]:
s1.index = list('abcdefghij')

In [60]:
df1 = pd.DataFrame(s1)
df1

       0
a    1.0
b   12.0
c   23.0
d   34.0
e   45.0
f   56.0
g   67.0
h   78.0
i   89.0
j  200.0

In [64]:
df1 = pd.DataFrame(s1, columns=['s1'])
df1

      s1
a    1.0
b   12.0
c   23.0
d   34.0
e   45.0
f   56.0
g   67.0
h   78.0
i   89.0
j  200.0

In [72]:
df2 = pd.DataFrame({'series1': s1, 'series2': s2})
df2

   series1  series2
a      1.0      NaN
b     12.0      NaN
c     23.0      NaN
d     34.0      NaN
e     45.0      NaN
f     56.0      0.0
g     67.0      1.0
h     78.0      2.0
i     89.0      3.0
j    200.0      4.0
k      NaN      5.0
l      NaN      6.0
m      NaN      7.0
n      NaN      8.0
o      NaN      9.0

In [84]:
df2 = pd.DataFrame({'series1': s1, 'series2': s2}, 
                   columns=['series2', 'series1'])
df2

   series2  series1
a      NaN      1.0
b      NaN     12.0
c      NaN     23.0
d      NaN     34.0
e      NaN     45.0
f      0.0     56.0
g      1.0     67.0
h      2.0     78.0
i      3.0     89.0
j      4.0    200.0
k      5.0      NaN
l      6.0      NaN
m      7.0      NaN
n      8.0      NaN
o      9.0      NaN

In [93]:
df2 = pd.DataFrame({'series1': s1, 'series2': s2}, 
                   index=reversed('abcdefghijklmno'))
df2

   series1  series2
o      NaN      9.0
n      NaN      8.0
m      NaN      7.0
l      NaN      6.0
k      NaN      5.0
j    200.0      4.0
i     89.0      3.0
h     78.0      2.0
g     67.0      1.0
f     56.0      0.0
e     45.0      NaN
d     34.0      NaN
c     23.0      NaN
b     12.0      NaN
a      1.0      NaN

In [95]:
df2 = pd.DataFrame({'series1': s1, 'series2': s2}, 
                   columns=['series2', 'series1'])
df2

   series2  series1
a      NaN      1.0
b      NaN     12.0
c      NaN     23.0
d      NaN     34.0
e      NaN     45.0
f      0.0     56.0
g      1.0     67.0
h      2.0     78.0
i      3.0     89.0
j      4.0    200.0
k      5.0      NaN
l      6.0      NaN
m      7.0      NaN
n      8.0      NaN
o      9.0      NaN

In [96]:
df2['series2']

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    0.0
g    1.0
h    2.0
i    3.0
j    4.0
k    5.0
l    6.0
m    7.0
n    8.0
o    9.0
Name: series2, dtype: float64

In [98]:
df2['series1']

a      1.0
b     12.0
c     23.0
d     34.0
e     45.0
f     56.0
g     67.0
h     78.0
i     89.0
j    200.0
k      NaN
l      NaN
m      NaN
n      NaN
o      NaN
Name: series1, dtype: float64

In [99]:
df2.series1

a      1.0
b     12.0
c     23.0
d     34.0
e     45.0
f     56.0
g     67.0
h     78.0
i     89.0
j    200.0
k      NaN
l      NaN
m      NaN
n      NaN
o      NaN
Name: series1, dtype: float64

In [100]:
df2.series1 * 2

a      2.0
b     24.0
c     46.0
d     68.0
e     90.0
f    112.0
g    134.0
h    156.0
i    178.0
j    400.0
k      NaN
l      NaN
m      NaN
n      NaN
o      NaN
Name: series1, dtype: float64

In [102]:
df2.series1 * 2 + df2['series2']

a      NaN
b      NaN
c      NaN
d      NaN
e      NaN
f    112.0
g    135.0
h    158.0
i    181.0
j    404.0
k      NaN
l      NaN
m      NaN
n      NaN
o      NaN
dtype: float64

In [119]:
df1.fillna?

In [125]:
(df1 + df2).combine_first(df2)

     series1  series2
foo
a        2.0      NaN
b       24.0      NaN
c       46.0      NaN
d       68.0      NaN
e       90.0      NaN
f      112.0      0.0
g      134.0      1.0
h      156.0      2.0
i      178.0      3.0
j      400.0      4.0
k        NaN      5.0
l        NaN      6.0
m        NaN      7.0
n        NaN      8.0
o        NaN      9.0

In [126]:
df2['foo'] = df2['series2']**2

In [128]:
df2['bar'] = 'bar'

In [130]:
df2['series2 again'] = s2

In [132]:
len(df2)

15

In [133]:
df2.shape

(15, 5)

In [135]:
df2['random'] = np.random.random(15)

In [137]:
df2['fail'] = [1, 2, 3]

ValueError: Length of values (3) does not match length of index (15)

In [140]:
del df2['random']

In [141]:
df2

     series2  series1   foo  bar  series2 again
foo
a        NaN      1.0   NaN  bar            NaN
b        NaN     12.0   NaN  bar            NaN
c        NaN     23.0   NaN  bar            NaN
d        NaN     34.0   NaN  bar            NaN
e        NaN     45.0   NaN  bar            NaN
f        0.0     56.0   0.0  bar            0.0
g        1.0     67.0   1.0  bar            1.0
h        2.0     78.0   4.0  bar            2.0
i        3.0     89.0   9.0  bar            3.0
j        4.0    200.0  16.0  bar            4.0
k        5.0      NaN  25.0  bar            5.0
l        6.0      NaN  36.0  bar            6.0
m        7.0      NaN  49.0  bar            7.0
n        8.0      NaN  64.0  bar            8.0
o        9.0      NaN  81.0  bar            9.0

In [142]:
df2['series2']

foo
a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    0.0
g    1.0
h    2.0
i    3.0
j    4.0
k    5.0
l    6.0
m    7.0
n    8.0
o    9.0
Name: series2, dtype: float64

In [143]:
df2[['series1', 'series2']]

     series1  series2
foo
a        1.0      NaN
b       12.0      NaN
c       23.0      NaN
d       34.0      NaN
e       45.0      NaN
f       56.0      0.0
g       67.0      1.0
h       78.0      2.0
i       89.0      3.0
j      200.0      4.0
k        NaN      5.0
l        NaN      6.0
m        NaN      7.0
n        NaN      8.0
o        NaN      9.0

In [144]:
df2[:3]

     series2  series1  foo  bar  series2 again
foo
a        NaN      1.0  NaN  bar            NaN
b        NaN     12.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN

In [145]:
df2.loc['f']

series2           0.0
series1          56.0
foo               0.0
bar               bar
series2 again     0.0
Name: f, dtype: object

In [146]:
df2.loc[['f', 'j']]

     series2  series1   foo  bar  series2 again
foo
f        0.0     56.0   0.0  bar            0.0
j        4.0    200.0  16.0  bar            4.0

In [147]:
df2.loc['b':'g']

     series2  series1  foo  bar  series2 again
foo
b        NaN     12.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN
d        NaN     34.0  NaN  bar            NaN
e        NaN     45.0  NaN  bar            NaN
f        0.0     56.0  0.0  bar            0.0
g        1.0     67.0  1.0  bar            1.0

In [149]:
df2.loc[df2.index.isin(['a', 'c', 'g'])]

     series2  series1  foo  bar  series2 again
foo
a        NaN      1.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN
g        1.0     67.0  1.0  bar            1.0

In [153]:
df2.loc['c':'e']

     series2  series1  foo  bar  series2 again
foo
c        NaN     23.0  NaN  bar            NaN
d        NaN     34.0  NaN  bar            NaN
e        NaN     45.0  NaN  bar            NaN

In [154]:
df2.loc[:'f']

     series2  series1  foo  bar  series2 again
foo
a        NaN      1.0  NaN  bar            NaN
b        NaN     12.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN
d        NaN     34.0  NaN  bar            NaN
e        NaN     45.0  NaN  bar            NaN
f        0.0     56.0  0.0  bar            0.0

In [155]:
df2.loc['a':'h':2]

     series2  series1  foo  bar  series2 again
foo
a        NaN      1.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN
e        NaN     45.0  NaN  bar            NaN
g        1.0     67.0  1.0  bar            1.0

In [157]:
df2.loc['h':'a':-2]

     series2  series1  foo  bar  series2 again
foo
h        2.0     78.0  4.0  bar            2.0
f        0.0     56.0  0.0  bar            0.0
d        NaN     34.0  NaN  bar            NaN
b        NaN     12.0  NaN  bar            NaN

In [159]:
df2.loc[:, 'series2']

foo
a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
f    0.0
g    1.0
h    2.0
i    3.0
j    4.0
k    5.0
l    6.0
m    7.0
n    8.0
o    9.0
Name: series2, dtype: float64

In [160]:
df2.loc[:, ['series2', 'foo']]

     series2   foo
foo
a        NaN   NaN
b        NaN   NaN
c        NaN   NaN
d        NaN   NaN
e        NaN   NaN
f        0.0   0.0
g        1.0   1.0
h        2.0   4.0
i        3.0   9.0
j        4.0  16.0
k        5.0  25.0
l        6.0  36.0
m        7.0  49.0
n        8.0  64.0
o        9.0  81.0

In [161]:
df2.loc[:, 'series2':'bar']

     series2  series1   foo  bar
foo
a        NaN      1.0   NaN  bar
b        NaN     12.0   NaN  bar
c        NaN     23.0   NaN  bar
d        NaN     34.0   NaN  bar
e        NaN     45.0   NaN  bar
f        0.0     56.0   0.0  bar
g        1.0     67.0   1.0  bar
h        2.0     78.0   4.0  bar
i        3.0     89.0   9.0  bar
j        4.0    200.0  16.0  bar
k        5.0      NaN  25.0  bar
l        6.0      NaN  36.0  bar
m        7.0      NaN  49.0  bar
n        8.0      NaN  64.0  bar
o        9.0      NaN  81.0  bar

In [162]:
df2.loc[:, 'series2':'bar':2]

     series2   foo
foo
a        NaN   NaN
b        NaN   NaN
c        NaN   NaN
d        NaN   NaN
e        NaN   NaN
f        0.0   0.0
g        1.0   1.0
h        2.0   4.0
i        3.0   9.0
j        4.0  16.0
k        5.0  25.0
l        6.0  36.0
m        7.0  49.0
n        8.0  64.0
o        9.0  81.0

In [164]:
df2.loc[:, :'series1']

     series2  series1
foo
a        NaN      1.0
b        NaN     12.0
c        NaN     23.0
d        NaN     34.0
e        NaN     45.0
f        0.0     56.0
g        1.0     67.0
h        2.0     78.0
i        3.0     89.0
j        4.0    200.0
k        5.0      NaN
l        6.0      NaN
m        7.0      NaN
n        8.0      NaN
o        9.0      NaN

In [165]:
df2.loc['a':'d', 'series1':'bar']

     series1  foo  bar
foo
a        1.0  NaN  bar
b       12.0  NaN  bar
c       23.0  NaN  bar
d       34.0  NaN  bar

In [166]:
df2.iloc[:6]

     series2  series1  foo  bar  series2 again
foo
a        NaN      1.0  NaN  bar            NaN
b        NaN     12.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN
d        NaN     34.0  NaN  bar            NaN
e        NaN     45.0  NaN  bar            NaN
f        0.0     56.0  0.0  bar            0.0

In [167]:
df2.iloc[3:10:3]

     series2  series1   foo  bar  series2 again
foo
d        NaN     34.0   NaN  bar            NaN
g        1.0     67.0   1.0  bar            1.0
j        4.0    200.0  16.0  bar            4.0

In [168]:
df2.iloc[:, 1:]

     series1   foo  bar  series2 again
foo
a        1.0   NaN  bar            NaN
b       12.0   NaN  bar            NaN
c       23.0   NaN  bar            NaN
d       34.0   NaN  bar            NaN
e       45.0   NaN  bar            NaN
f       56.0   0.0  bar            0.0
g       67.0   1.0  bar            1.0
h       78.0   4.0  bar            2.0
i       89.0   9.0  bar            3.0
j      200.0  16.0  bar            4.0
k        NaN  25.0  bar            5.0
l        NaN  36.0  bar            6.0
m        NaN  49.0  bar            7.0
n        NaN  64.0  bar            8.0
o        NaN  81.0  bar            9.0

In [169]:
df2.iloc[3:7, ::2]

     series2  foo  series2 again
foo
d        NaN  NaN            NaN
e        NaN  NaN            NaN
f        0.0  0.0            0.0
g        1.0  1.0            1.0

In [170]:
df2[df2['series2'] > 5]

     series2  series1   foo  bar  series2 again
foo
l        6.0      NaN  36.0  bar            6.0
m        7.0      NaN  49.0  bar            7.0
n        8.0      NaN  64.0  bar            8.0
o        9.0      NaN  81.0  bar            9.0

In [175]:
df2[(df2.series2 > 5) & (df2['foo'] > 50)]

foo
n    64.0
o    81.0
Name: foo, dtype: float64

In [172]:
df2.query('series2 > 5')

     series2  series1   foo  bar  series2 again
foo
l        6.0      NaN  36.0  bar            6.0
m        7.0      NaN  49.0  bar            7.0
n        8.0      NaN  64.0  bar            8.0
o        9.0      NaN  81.0  bar            9.0

In [173]:
df2.query('(series2 > 5) & (foo > 50)')

     series2  series1   foo  bar  series2 again
foo
n        8.0      NaN  64.0  bar            8.0
o        9.0      NaN  81.0  bar            9.0

In [176]:
df2.loc[df2.index.isin(list('aeiou')), df2.columns.str.startswith('series')]

     series2  series1  series2 again
foo
a        NaN      1.0            NaN
e        NaN     45.0            NaN
i        3.0     89.0            3.0
o        9.0      NaN            9.0

In [179]:
df2.query('index in ["a", "e", "i", "o", "u"]')

     series2  series1   foo  bar  series2 again
foo
a        NaN      1.0   NaN  bar            NaN
e        NaN     45.0   NaN  bar            NaN
i        3.0     89.0   9.0  bar            3.0
o        9.0      NaN  81.0  bar            9.0

In [180]:
df2.head()

     series2  series1  foo  bar  series2 again
foo
a        NaN      1.0  NaN  bar            NaN
b        NaN     12.0  NaN  bar            NaN
c        NaN     23.0  NaN  bar            NaN
d        NaN     34.0  NaN  bar            NaN
e        NaN     45.0  NaN  bar            NaN

In [181]:
df2.tail()

     series2  series1   foo  bar  series2 again
foo
k        5.0      NaN  25.0  bar            5.0
l        6.0      NaN  36.0  bar            6.0
m        7.0      NaN  49.0  bar            7.0
n        8.0      NaN  64.0  bar            8.0
o        9.0      NaN  81.0  bar            9.0

In [182]:
df2.head(10)

     series2  series1   foo  bar  series2 again
foo
a        NaN      1.0   NaN  bar            NaN
b        NaN     12.0   NaN  bar            NaN
c        NaN     23.0   NaN  bar            NaN
d        NaN     34.0   NaN  bar            NaN
e        NaN     45.0   NaN  bar            NaN
f        0.0     56.0   0.0  bar            0.0
g        1.0     67.0   1.0  bar            1.0
h        2.0     78.0   4.0  bar            2.0
i        3.0     89.0   9.0  bar            3.0
j        4.0    200.0  16.0  bar            4.0

In [183]:
df2.tail(10)

     series2  series1   foo  bar  series2 again
foo
f        0.0     56.0   0.0  bar            0.0
g        1.0     67.0   1.0  bar            1.0
h        2.0     78.0   4.0  bar            2.0
i        3.0     89.0   9.0  bar            3.0
j        4.0    200.0  16.0  bar            4.0
k        5.0      NaN  25.0  bar            5.0
l        6.0      NaN  36.0  bar            6.0
m        7.0      NaN  49.0  bar            7.0
n        8.0      NaN  64.0  bar            8.0
o        9.0      NaN  81.0  bar            9.0

In [185]:
df2['series1'].array

<PandasArray>
[  1.0,  12.0,  23.0,  34.0,  45.0,  56.0,  67.0,  78.0,  89.0, 200.0,   nan,
   nan,   nan,   nan,   nan]
Length: 15, dtype: float64

In [186]:
df2['series1'].to_numpy()

array([  1.,  12.,  23.,  34.,  45.,  56.,  67.,  78.,  89., 200.,  nan,
        nan,  nan,  nan,  nan])

In [187]:
df2.sum()

series2                                                   45.0
series1                                                  605.0
foo                                                      285.0
bar              barbarbarbarbarbarbarbarbarbarbarbarbarbarbar
series2 again                                             45.0
dtype: object

In [188]:
df2.sum(axis=1)

foo
a      1.0
b     12.0
c     23.0
d     34.0
e     45.0
f     56.0
g     70.0
h     86.0
i    104.0
j    224.0
k     35.0
l     48.0
m     63.0
n     80.0
o     99.0
dtype: float64

In [189]:
df2.count()

series2          10
series1          10
foo              10
bar              15
series2 again    10
dtype: int64

In [190]:
df2.min()

series2          0.0
series1          1.0
foo              0.0
bar              bar
series2 again    0.0
dtype: object

In [191]:
df2.max()

series2            9.0
series1          200.0
foo               81.0
bar                bar
series2 again      9.0
dtype: object

In [192]:
df2.mean()

series2           4.5
series1          60.5
foo              28.5
series2 again     4.5
dtype: float64

In [193]:
df2.median()

series2           4.5
series1          50.5
foo              20.5
series2 again     4.5
dtype: float64

In [196]:
df2[['series1', 'series2']].abs()

     series1  series2
foo
a        1.0      NaN
b       12.0      NaN
c       23.0      NaN
d       34.0      NaN
e       45.0      NaN
f       56.0      0.0
g       67.0      1.0
h       78.0      2.0
i       89.0      3.0
j      200.0      4.0
k        NaN      5.0
l        NaN      6.0
m        NaN      7.0
n        NaN      8.0
o        NaN      9.0

In [198]:
df2.quantile(0.75)

series2           6.75
series1          75.25
foo              45.75
series2 again     6.75
Name: 0.75, dtype: float64

In [199]:
df2.cumsum()

,series2,series1,foo,bar,series2 again
foo,,,,,
a,NaN,1.0,NaN,bar,NaN
b,NaN,13.0,NaN,barbar,NaN
c,NaN,36.0,NaN,barbarbar,NaN
d,NaN,70.0,NaN,barbarbarbar,NaN
e,NaN,115.0,NaN,barbarbarbarbar,NaN
f,0.0,171.0,0.0,barbarbarbarbarbar,0.0
g,1.0,238.0,1.0,barbarbarbarbarbarbar,1.0
h,3.0,316.0,5.0,barbarbarbarbarbarbarbar,3.0
i,6.0,405.0,14.0,barbarbarbarbarbarbarbarbar,6.0
j,10.0,605.0,30.0,barbarbarbarbarbarbarbarbarbar,10.0
k,15.0,NaN,55.0,barbarbarbarbarbarbarbarbarbarbar,15.0
l,21.0,NaN,91.0,barbarbarbarbarbarbarbarbarbarbarbar,21.0
m,28.0,NaN,140.0,barbarbarbarbarbarbarbarbarbarbarbarbar,28.0
n,36.0,NaN,204.0,barbarbarbarbarbarbarbarbarbarbarbarbarbar,36.0
o,45.0,NaN,285.0,barbarbarbarbarbarbarbarbarbarbarbarbarbarbar,45.0

In [200]:
df2.head?

In [202]:
df2.iloc[:, :2]

     series2  series1
foo
a        NaN      1.0
b        NaN     12.0
c        NaN     23.0
d        NaN     34.0
e        NaN     45.0
f        0.0     56.0
g        1.0     67.0
h        2.0     78.0
i        3.0     89.0
j        4.0    200.0
k        5.0      NaN
l        6.0      NaN
m        7.0      NaN
n        8.0      NaN
o        9.0      NaN